// Циклы в JavaScript можно реализовать тремя способами



// Первый цикл

// let num = 50;

// while (num <= 50) {    // Пока что это условие выполняется, мы будем делать какието действия
//     console.log(num);
//     num++;   
// }            // Пока наше условие не выполнено,выполнять какие-то действия



// // Второй цикл
// //При помощи этого цикла мы можем сначала заставить его что-то сделать, а потом уже проверить условия

// do {
//     console.log(num);
//     num++;
// }
// while (num <55);



//Третий цикл
// Самый часто используемый цикл,потомучто его можно подробно настроить

// let num = 50;

// for (let i = 1; i < 10; i++) {
//     if (i === 6) {
//         //break;
//         continue;
//     }
//     console.log(i);
// }

